[
  {
    "term": "Machine Learning is a subset of Artificial Intelligence",
    "definition": "False"
  },
  {
    "term": "Deep Learning is a subset of Machine Learning",
    "definition": "False"
  },
  {
    "term": "Machine Learning consists in programming computers to learn from real-time human interactions",
    "definition": "True"
  },
  {
    "term": "AI Winters happened mostly due to the lack of understanding behind the theory of neural networks",
    "definition": "True"
  },
  {
    "term": "Most modern applications that use computer vision, use models that were trained using this discipline:",
    "definition": "Deep Learning"
  },
  {
    "term": "In the Machine Learning Workflow, the main goal of the Data Exploration and Preprocessing step is to:",
    "definition": "Determine how to clean your data such that you can use it to train a model"
  },
  {
    "term": "What is the goal of supervised learning?",
    "definition": "Predict the labels."
  },
  {
    "term": "What is deep learning?",
    "definition": "Deep learning is machine learning that involves deep neural networks."
  },
  {
    "term": "When is a standard machine learning algorithm usually a better choice than using deep learning to get the job done?",
    "definition": "When working with small data sets."
  },
  {
    "term": "What is a Turing test?",
    "definition": "It tests a machine's ability to exhibit intelligent behavior."
  },
  {
    "term": "What are some of the different milestones in deep learning history?",
    "definition": "Geoffrey Hinton's work, AlexNet, and TensorFlow"
  },
  {
    "term": "What is artificial intelligence?",
    "definition": "Any program that can sense, reason, act, and adapt."
  },
  {
    "term": "What are two spaces within AI that are going through drastic growth and innovation?",
    "definition": "Computer vision and natural language processing."
  },
  {
    "term": "Why did AI flourish so much in the last years?",
    "definition": "Faster and inexpensive computers and data storage"
  },
  {
    "term": "How does Alexa use artificial intelligence?",
    "definition": "Recognizes our voice and answers questions."
  },
  {
    "term": "What are the first two steps of a typical machine learning workflow?",
    "definition": "Problem statement and data collection."
  },
  {
    "term": "Which statement about the Pandas read_csv function is TRUE?",
    "definition": "It can read both tab-delimited and space-delimited data."
  },
  {
    "term": "Which of the following is a reason to use JavaScript Object Notation (JSON) files for storing data?",
    "definition": "Because they are cross-platform compatible."
  },
  {
    "term": "The data below appears in 'data.txt', and Pandas has been imported. Which Python command will read it correctly into a Pandas DataFrame?63.03 22.55 39.61 40.48 98.67 -0.25 AB39.06 10.06 25.02 29 114.41 4.56 AB68.83 22.22 50.09 46.61 105.99 -3.53 AB",
    "definition": "pandas.read_csv('data.txt', header=None, sep=' ')"
  },
  {
    "term": "Outliers must be very extreme to noticeably impact the fit of a statistical model.",
    "definition": "False"
  },
  {
    "term": "Outliers should always be replaced, since they never contain useful information about the data.",
    "definition": "False"
  },
  {
    "term": "Which residual-based approach to identifying outliers compares running a model with all data to running the same model, but dropping a single observation?",
    "definition": "Externally-studentized residuals"
  },
  {
    "term": "What is a CSV file?",
    "definition": "CSV files are rows of data or values separated by commas."
  },
  {
    "term": "What are residuals?",
    "definition": "Residuals are the difference between the actual values and the values predicted by a given model."
  },
  {
    "term": "If removal of rows or columns of data is not an option, why must we ensure that information is assigned for missing data?",
    "definition": "Most models will not accept blank values in our data."
  },
  {
    "term": "What are the two main data problems companies face when getting started with artificial intelligence/machine learning?",
    "definition": "Lack of relevant data and bad data"
  },
  {
    "term": "What does SQL stand for and what does it represent?",
    "definition": "SQL stands for Structured Query Language, and it represents a set of relational databases with fixed schemas."
  },
  {
    "term": "What does NoSQL stand for and what does it represent?",
    "definition": "NoSQL stands for Not-only SQL, and it represents a set of databases that are not relational, therefore, they vary in structure."
  },
  {
    "term": "What is a JSON file?",
    "definition": "JSON stands for JavaString Object Notation, and it is a standard way to store the data across platforms."
  },
  {
    "term": "What is meant by the Messy Data?",
    "definition": "All of the above."
  },
  {
    "term": "What is an outlier?",
    "definition": "Outlier is an observation in dataset that is distant from most other observations."
  },
  {
    "term": "How do we identify outliers in our dataset?",
    "definition": "We can identify outliers both visually and with statistical calculations."
  },
  {
    "term": "From the options listed below, select the option that is NOT a valid exploratory data approach to visually confirm whether your data is ready for modeling or if it needs further cleaning or data processing:",
    "definition": "Create a correlation heatmap to confirm the sign and magnitude of correlation across your features."
  },
  {
    "term": "These are two of the most common variables for data visualization:",
    "definition": "matplotlib and seaborn"
  },
  {
    "term": "You can use the pandas library to use plots.",
    "definition": "True"
  },
  {
    "term": "Classification models require that input features be scaled.",
    "definition": "False"
  },
  {
    "term": "Feature scaling allows better interpretation of distance-based approaches.",
    "definition": "True"
  },
  {
    "term": "Feature scaling reduces distortions caused by variables with different scales.",
    "definition": "True"
  },
  {
    "term": "Which scaling approach converts features to standard normal variables?",
    "definition": "Standard scaling"
  },
  {
    "term": "Which variable transformation should you use for ordinal data?",
    "definition": "Ordinal encoding"
  },
  {
    "term": "What are polynomial features?",
    "definition": "They are higher order relationships in the data."
  },
  {
    "term": "What does Boxcox transformation do?",
    "definition": "It transforms the data distribution into more symmetrical bell curve"
  },
  {
    "term": "Select three important reasons why EDA is useful.",
    "definition": "To determine if the data makes sense, to determine whether further data cleaning is needed, and to help identify patterns and trends in the data"
  },
  {
    "term": "What assumption does the linear regression model make about data?",
    "definition": "This model assumes a linear relationship between predictor variables and outcome variables."
  },
  {
    "term": "What is skewed data?",
    "definition": "Data that is distorted away from normal distribution; may be positively or negatively skewed."
  },
  {
    "term": "Select the two primary types of categorical feature encoding.",
    "definition": "Nominal encoding and ordinal encoding"
  },
  {
    "term": "Which scaling approach puts values between zero and one?",
    "definition": "Min-max scaling"
  },
  {
    "term": "Which variable transformation should you use for nominal data with multiple different values within the feature?",
    "definition": "One-hot encoding"
  },
  {
    "term": "In general, the population parameters are unknown.",
    "definition": "True"
  },
  {
    "term": "Parametric models have finite number of parameters.",
    "definition": "True"
  },
  {
    "term": "The most common way of estimating parameters in a parametric model is:",
    "definition": "using the maximum likelihood estimation"
  },
  {
    "term": "A p-value is:",
    "definition": "the smallest significance level at which the null hypothesis would be rejected"
  },
  {
    "term": "Type 1 Error 1 is defined as:",
    "definition": "Saying the null hypothesis is false, when it is actually true"
  },
  {
    "term": "You find through a graph that there is a strong correlation between Net Promoter Score and the visual time that customers spend on a website. Select the TRUE assertion:",
    "definition": "There is an underlying factor that explains this correlation, but manipulating the time that customers spend on a website may not affect the Net Promoter Score they will give to the company"
  },
  {
    "term": "Which one of the following is common to both machine learning and statistical inference?",
    "definition": "Using sample data to infer qualities of the underlying population distribution."
  },
  {
    "term": "Which one of the following describes an approach to customer churn prediction stated in terms of probability?",
    "definition": "Predicting a score for individuals that estimates the probability the customer will leave."
  },
  {
    "term": "What is customer lifetime value?",
    "definition": "The total purchases over the time which the person is a customer."
  },
  {
    "term": "Which one the following statements about the normalized histogram of a variable is true?",
    "definition": "It provides an estimate of the variable's probability distribution."
  },
  {
    "term": "The outcome of rolling a fair die can be modelled as a _______ distribution.",
    "definition": "uniform"
  },
  {
    "term": "Which one of the following features best distinguishes the Bayesian approach to statistics from the Frequentist approach?",
    "definition": "Bayesian statistics incorporate the probability of the hypothesis being true."
  },
  {
    "term": "Which of the following best describes what a hypothesis is?",
    "definition": "A hypothesis is a statement about a population."
  },
  {
    "term": "A Type 2 error in hypothesis testing is _____________________:",
    "definition": "incorrectly accepting the null hypothesis."
  },
  {
    "term": "Which statement best describes a consequence of a type II error in the context of a churn prediction example? Assume that the null hypothesis is that customer churn is due to chance, and that the alternative hypothesis is that customers enrolled for greater than two years will not churn over the next year.",
    "definition": "You incorrectly conclude that customer churn is by chance"
  },
  {
    "term": "Which of the following is a statistic used for hypothesis testing?",
    "definition": "The likelihood ratio."
  },
  {
    "term": "Predicting payment default, whether a transaction is fraudulent, and whether a customer will be part of the top 5% spenders on a given year, are examples of:",
    "definition": "classification"
  },
  {
    "term": "It is less concerning to treat a Machine Learning model as a black box for prediction purposes, compared to interpretation purposes:",
    "definition": "True"
  },
  {
    "term": "Predicting total revenue, number of customers, and percentage of returning customers are examples of:",
    "definition": "regression"
  },
  {
    "term": "The Sum of Squared Errors (SSE) can be used to select the best-fitting regression model",
    "definition": "True"
  },
  {
    "term": "The R-squared value from estimating a linear regression model will almost always increase if more features are added.",
    "definition": "True"
  },
  {
    "term": "The Total Sum of Squares (TSS) can be used to select the best-fitting regression model.",
    "definition": "False"
  },
  {
    "term": "You can use supervised machine learning for all of the following examples, EXCEPT:",
    "definition": "Segment customers by their demographics."
  },
  {
    "term": "The autocorrect on your phone is an example of:",
    "definition": "Supervised learning"
  },
  {
    "term": "This is the type of Machine Learning that uses both data with labeled outcomes and data without labeled outcomes:",
    "definition": "Semi-Supervised Machine Learning"
  },
  {
    "term": "This option describes a way of turning a regression problem into a classification problem:",
    "definition": "Create a new variable that flags 1 for above a certain value and 0 otherwise"
  },
  {
    "term": "This is the syntax you need to predict new data after you have trained a linear regression model called LR :",
    "definition": "LR.predict(X_test)"
  },
  {
    "term": "All of these options are useful error measures to compare regressions except:",
    "definition": "ROC index"
  },
  {
    "term": "All of the listed below are part of the Machine Learning Framework, except:",
    "definition": "None of the above"
  },
  {
    "term": "Select the option that is the most INACCURATE regarding the definition of Machine Learning:",
    "definition": "Machine Learning is automated and requires no programming"
  },
  {
    "term": "In Linear Regression, which statement about model evaluation is the most accurate?",
    "definition": "Model estimation involves choosing parameters that minimize the cost function."
  },
  {
    "term": "When learning about regression we saw the outcome as a continuous number. Given the below options what is an example of regression?",
    "definition": "Housing prices"
  },
  {
    "term": "What is another term for the testing data:",
    "definition": "Unseen data"
  },
  {
    "term": "The ShuffleSplit will ensure that there is no bias in your outcome variable.",
    "definition": "True"
  },
  {
    "term": "Select the option that has the syntax to obtain the data splits you will need to train a model having a test split that is a third the size of your available data.",
    "definition": "X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.33)"
  },
  {
    "term": "What is the main goal of adding polynomial features to a linear regression?",
    "definition": "Capture the relation of the outcome with features of higher order."
  },
  {
    "term": "What is the most common sklearn methods to add polynomial features to your data?Note: polyFeat = PolynomialFeatures(degree)",
    "definition": "polyFeat.fit and polyFeat.transform"
  },
  {
    "term": "How can you adjust the standard linear approach to regression when dealing with fundamental problems such as prediction or interpretation?",
    "definition": "Add some non-linear patterns, i.e., polynomial features"
  },
  {
    "term": "The main purpose of splitting your data into a training and test sets is:",
    "definition": "To avoid overfitting"
  },
  {
    "term": "Complete the following sentence: The training data is used to fit the model, while the test data is used to:",
    "definition": "measure error and performance of the model"
  },
  {
    "term": "What term is used if your test data leaks into the training data?",
    "definition": "Data leakage"
  },
  {
    "term": "Which one of the below terms use a linear combination of features?",
    "definition": "Polynomial Regression"
  },
  {
    "term": "When splitting your data, what is the purpose of the training data?",
    "definition": "Fit the actual model and learn the parameters"
  },
  {
    "term": "Polynomial features capture what effects?",
    "definition": "Multiple effects."
  },
  {
    "term": "Which fundamental problems are being solved by adding non-linear patterns, such as polynomial features, to a standard linear approach?",
    "definition": "Prediction and Interpretation."
  },
  {
    "term": "A testing data could be also reffered to as:",
    "definition": "Unseen data"
  },
  {
    "term": "Select the correct syntax to obtain the data split that will result in a train set that is 60% of the size of your available data.",
    "definition": "X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.4)"
  },
  {
    "term": "What is the correct sklearn syntax to add a third degree polynomial to your model?",
    "definition": "polyFeat = PolynomialFeatures(degree=3)"
  },
  {
    "term": "In model complexity versus error diagram, the model compexity increases as the training error decreases.",
    "definition": "False"
  },
  {
    "term": "In model complexity versus error diagram, there is an inflection point after which, as the cross validatio error increases, so does the complexity of the model.",
    "definition": "True"
  },
  {
    "term": "In the model complexity versus error diagram, the right side of the curve is where the model is underfitted and the left side of the curve, is where the model is overfitted.",
    "definition": "False"
  },
  {
    "term": "In K-fold cross-validation, how will increasing k affect the variance (across subsamples) of estimated model parameters?",
    "definition": "Increasing k will usually increase the variance of estimated parameters."
  }
]